package com.util;

public class GuessingMessageUtil {

    public String guessingGameStartMsg() {
        return "\n\n\n\n추리 게임 START\n\n"
                + "성민이는 주말을 맞아 외딴 마을에 위치한 '기괴한 저택'에 초대됩니다.\n"
                + "저택은 과거 유명한 탐정이 살던 곳으로, 지금은 그의 후손이 거주하고 있습니다.\n"
                + "저택에는 많은 비밀과 수수께끼가 얽혀 있다고 알려져 있습니다.\n\n"
                + "성민이는 이 저택의 비밀을 밝혀내기 위해 모험을 떠나게 됩니다.\n"
                + "과연 어떤 수수께끼와 위험이 당신을 기다리고 있을까요?\n\n";
    }

    public String guessingMsg1() {
        return "문제: 선물 가게에서 한 여성이 사망한 채 발견되었습니다.\n"
                + "발견 당시 피해자는 이어폰을 꽂고 있었으나 음악은 정지된 채, 한 손으로 모래시계를 가리키고 있었습니다.\n"
                + "다음 다섯 명의 용의자 중 범인을 찾으세요:\n"
                + "1. Steve (남, 35세) - 의사\n"
                + "2. Anna (여, 29세) - 레스토랑 운영\n"
                + "3. Tom (남, 42세) - 선물 가게 주인\n"
                + "4. Daniel (남, 27세) - 무직\n"
                + "5. Jenny (여, 39세) - 교사\n";
    }

    public String guessingMsg2() {
        return "문제: 한 회사의 간부인 P씨가 회사 내에서 살해당한 채 발견되었습니다.\n"
                + "P씨의 컴퓨터에는 '741231475369'라는 의문의 메시지가 남아있었습니다.\n"
                + "다음 용의자 중 범인을 찾으세요 : \n"
                + "1. Jonn Black (52세, 남 / 엔지니어) - 이유 없는 인사이동 불만을 품음\n"
                + "2. Lenny Nilson (30세, 남 / 운전기사) - P씨의 잦은 폭언에 최근 사직서 제출\n"
                + "3. Alison Ruby (23세, 여 / 비서) - P씨의 무례한 행동에 수치심을 느낌\n"
                + "4. Sheldon Wanda (41세, 여 / 청소부) - 임금 문제로 1인 시위 중\n";
    }

    public String guessingMsg3() {
        return "문제: 아파트 상가에서 살인 사건이 일어났다.\n"
                + "외국인이었던 피해자는 'A ㅁ P'라는 다잉 메시지를 남겼는데, 범인은 누구일까?\n"
                + "1. 안영평 (32세, 상가 201호 ABC 학원 영어 강사)\n"
                + "2. 박우용 (40세, 상가 409호 생명 산부인과 원장)\n"
                + "3. 소영원 (36세, 상가 802호 뷰티풀 디자인 회사 직원)\n"
                + "4. 배윤재 (42세, 상가 103호 산지직송 과일가게 주인)\n\n"
                + "이 수수께끼를 풀고 범인을 밝혀내세요!\n\n";
    }
}