package com.run;

import com.service.GameService;

import java.util.Scanner;

public class Main {

    static Scanner scanner = new Scanner(System.in);
    
    static GameService gameService;

    public static void main(String[] args) {
        System.out.println("================================================================================================================================================================");
        System.out.println(" _______   _______ .___________. _______   ______ .___________. __  ____    ____  _______      _______. __    __  .__   __.   _______ .___  ___.  __  .__   __. \n" +
                "|       \\ |   ____||           ||   ____| /      ||           ||  | \\   \\  /   / |   ____|    /       ||  |  |  | |  \\ |  |  /  _____||   \\/   | |  | |  \\ |  | \n" +
                "|  .--.  ||  |__   `---|  |----`|  |__   |  ,----'`---|  |----`|  |  \\   \\/   /  |  |__      |   (----`|  |  |  | |   \\|  | |  |  __  |  \\  /  | |  | |   \\|  | \n" +
                "|  |  |  ||   __|      |  |     |   __|  |  |         |  |     |  |   \\      /   |   __|      \\   \\    |  |  |  | |  . `  | |  | |_ | |  |\\/|  | |  | |  . `  | \n" +
                "|  '--'  ||  |____     |  |     |  |____ |  `----.    |  |     |  |    \\    /    |  |____ .----)   |   |  `--'  | |  |\\   | |  |__| | |  |  |  | |  | |  |\\   | \n" +
                "|_______/ |_______|    |__|     |_______| \\______|    |__|     |__|     \\__/     |_______||_______/     \\______/  |__| \\__|  \\______| |__|  |__| |__| |__| \\__| \n" +
                "                                                                                                                                                                ");
        System.out.println("=================================================================================================================================================================");

        System.out.println("1. 로그인");
        System.out.println("2. 회원가입");
        String c = scanner.nextLine();

        if("1".equals(c)) {
            login();
        } else {
            createUser();
        }
        
        //로그인한 유저만 게임 페이지 진입 가능
        if(/*아이디가 있을 경우*/) {
            startGame();
        }

    }

    public static void login() {

    }

    public static void createUser() {

    }

    public void startGame() {
        gameService.startGame();
    }

    public void stopGame() {

    }

}